function showHomePage() {
	document.getElementById('content').innerHTML = `<h1>Головна сторінка</h1><div class="important-data">
	<h3>Важливі показники</h2>
	<table>
		<tr>
			<td>Споживча інфляція (% річних)</td>
			<td>5,3</td>
		</tr>
		<tr>
			<td>Облікова ставка (% річних)</td>
			<td>16,0</td>
		</tr>
		<tr>
			<td>Офіційний курс до євро (грн &rarr; євро)</td>
			<td>39,6579</td>
		</tr>
		<tr>
			<td>Офіційний курс до дол. США (грн &rarr; дол. США)</td>
			<td>36,2173</td>
		</tr>
		<tr>
			<td>Міжнародні резерви (млрд дол. США)</td>
			<td>38,99</td>
		</tr>
	</table>
</div>
<div>Національний банк України завершив перший етап оцінки стійкості банків і банківської системи, розпочатої у травні для визначення реального стану кредитного портфеля банків під час війни. У межах цього етапу проведено оцінку якості активів та прийнятності забезпечення за кредитними операціями 20 найбільших банків із сумарною часткою понад 90% чистих активів всієї банківської системи. Результати першого етапу підтвердили очікування Національного банку про належну оцінку банками якості кредитів. Унаслідок оцінки якості активів сукупне коригування кредитного ризику становило близько 1% від його обсягу за даними банків. Отже, більшість банків адекватно оцінюють потенційні втрати кредитного портфеля та відображають пруденційні і фінансові резерви під знецінення кредитів. Другий і третій етапи оцінки стійкості банків тривають, їхнє завершення заплановане на грудень 2023 року. Попередні результати оцінки стійкості банків – оптимістичні: підвищені вимоги до нормативів достатності капіталу можуть виникнути лише в кількох установ, більшість з яких вже мають достатній запас капіталу, зокрема за рахунок накопичених прибутків.   Банківський сектор у цілому адаптувався до роботи в умовах повномасштабної війни та демонструє чіткі ознаки зростання. За даними Огляду банківського сектору за ІІІ квартал, корпоративне кредитування відновлюється після спаду, зумовленого вторгненням рф, а роздрібне – зростає в усіх сегментах. Банки зберігають високі показники прибутковості, що забезпечують подальше нарощення капіталу. Незважаючи на очікуване підвищення ставки податку на прибуток банків, зростання капіталу триватиме.  Ураховуючи попередні результати оцінки стійкості банків і поточний стан сектору, Національний банк відновлює раніше призупинені регуляторні вимоги до банків та запроваджує нові. Ці вимоги відповідають зобов'язанням України щодо імплементації норм законодавства Європейського Союзу стосовно достатності капіталу та ліквідності фінансових установ, а також Базельським рекомендаціям. Так, банкам потрібно врахувати у своїй діяльності відновлення таких вимог:</div>`;
}

function showCreditPage() {
	document.getElementById('content').innerHTML = `
	<h1>Сутність кредиту</h1>
    
    <p>Кредит - це фінансова угода, за якою одна сторона (кредитор) надає грошові кошти іншій стороні (позичальнику) на певних умовах. Кредит має основні характеристики: сума позики, відсоткова ставка, термін погашення. Основна мета кредиту - надання фінансових можливостей для реалізації планів та задоволення потреб, які зараз недосяжні через відсутність власних коштів.</p>
    
    <h2>Види кредитів</h2>
    <p>Кредити поділяються на різні види, такі як:
	 <ul>
	 <li> Іпотека - це вид кредиту, який використовується для придбання нерухомості. Зазвичай має тривалий термін погашення (зазвичай від 15 до 30 років). Особливістю є те, що припускається використання придбаної нерухомості як застави для кредиту.</li>
	 <li> Автокредит - це кредит, призначений для придбання автомобіля. Термін погашення зазвичай коротший, ніж у інших видів кредитів. Часто автомобіль, що придбається за кредит, виступає як застава.</li> 
	 <li> Споживчий кредит - це кредит, який не має конкретного призначення використання коштів. Він може бути використаний для різних особистих потреб, таких як покупки, оплата послуг, ремонт тощо.</li>
	 <li> Бізнес-кредит - це кредит, наданий для підтримки бізнесу, розвитку підприємства, придбання обладнання чи розширення діяльності. Умови цього кредиту можуть відрізнятися від умов споживчих кредитів та мати більші обсяги та довші терміни погашення.</li></ul>
	 Кожен з них має свої особливості, призначення та умови.</p>
    
    <h2>Основні аспекти кредитування</h2>
    <p>Процес отримання кредиту включає подання заявки, перевірку кредитної історії, розгляд заявки, визначення відсоткової ставки, підписання угоди та розрахунок умов погашення.</p>
    
    <h2>Важливі аспекти при виборі кредиту</h2>
    <p>Важливо розглянути відсоткову ставку, термін погашення, наявність прихованих витрат та інші фактори при виборі оптимального кредиту.</p>
    
    <h2>Цікаві факти про кредити</h2>
    <p>Кредити мають довгу історію та розвиваються разом із суспільством. Вони використовуються для різних цілей, від особистих до бізнесових.</p>
    
    <button onclick="showKnowledgeCheckPage()">Пройти тест на знання про кредити</button>
  `;
}

function showCalculatorPage() {
	document.getElementById('content').innerHTML = `
        <h1>Калькулятор кредиту</h1>
        <div id="mortgageCalculator">
            <label for="loanAmount">Сума кредиту:</label>
            <input type="number" id="loanAmount" placeholder="Сума кредиту"><br><br>
            <label for="interestRate">Відсоткова ставка (% річних):</label>
            <input type="number" id="interestRate" placeholder="Відсоткова ставка"><br><br>
            <label for="loanTerm">Термін погашення (роки):</label>
            <input type="number" id="loanTerm" placeholder="Термін погашення"><br><br>
            <button onclick="calculateMortgage()">Розрахувати</button>
            <p id="result"></p>
        </div>
    `;

}
function calculateMortgage() {
	let loanAmount = parseFloat(document.getElementById('loanAmount').value);
	let interestRate = parseFloat(document.getElementById('interestRate').value);
	let loanTerm = parseFloat(document.getElementById('loanTerm').value);

	let monthlyInterest = interestRate / 100 / 12;
	let totalPayments = loanTerm * 12;

	let monthlyPayment = (loanAmount * monthlyInterest) / (1 - Math.pow(1 + monthlyInterest, -totalPayments));

	document.getElementById('result').innerHTML = `Щомісячний платіж: ${monthlyPayment.toFixed(2)} грн`;
}


function showKnowledgeCheckPage() {
	document.getElementById('content').innerHTML = `
    <h1>Перевірка знань</h1>
    <form id="quizForm">
      <h3>Сутність кредиту</h3>
      <label for="q1a"><input type="radio" name="q1" id="q1a" value="correct">Кредит - це фінансова угода, за якою одна сторона надає грошові кошти іншій стороні на певних умовах.</label><br>
      <label for="q1b"><input type="radio" name="q1" id="q1b" value="incorrect">Кредит - це відсутність грошових коштів у банку.</label><br>
      <label for="q1c"><input type="radio" name="q1" id="q1c" value="incorrect">Кредит - це подарунок від фінансової установи.</label><br>
      <br>
      <h3>Іпотека це...</h3>
      <label for="q2a"><input type="radio" name="q2" id="q2a" value="correct">вид кредиту для придбання нерухомості.</label><br>
      <label for="q2b"><input type="radio" name="q2" id="q2b" value="incorrect">вид кредиту для придбання автомобіля.</label><br>
      <label for="q2c"><input type="radio" name="q2" id="q2c" value="incorrect">вид кредиту для відпочинку.</label><br>
      <br>
      <h3>Які основні особливості іпотеки?</h3>
      
      <label for="q3a"><input type="radio" name="q3" id="q3a" value="correct">Термін погашення від 15 до 30 років, використання придбаної нерухомості як застави.</label><br>
      <label for="q3b"><input type="radio" name="q3" id="q3b" value="incorrect">Термін погашення від 5 до 10 років, використання автомобіля як застави.</label><br>
      <label for="q3c"><input type="radio" name="q3" id="q3c" value="incorrect">Термін погашення від 1 до 5 років, відсутність застави.</label><br>
      <br>
      
      <h3>Які основні характеристики автокредиту?</h3>
      <label for="q4a"><input type="radio" name="q4" id="q4a" value="correct">Термін погашення зазвичай коротший, автомобіль виступає як застава.</label><br>
      <label for="q4b"><input type="radio" name="q4" id="q4b" value="incorrect">Термін погашення зазвичай дуже довгий, нерухомість виступає як застава.</label><br>
      <label for="q4c"><input type="radio" name="q4" id="q4c" value="incorrect">Автокредит не потребує відшкодування.</label><br>
      <br>

      <h3>Які особливості споживчого кредиту?</h3>
      
      <label for="q5a"><input type="radio" name="q5" id="q5a" value="correct">Немає конкретного призначення використання коштів.</label><br>
      <label for="q5b"><input type="radio" name="q5" id="q5b" value="incorrect">Використовується виключно для покупки нерухомості.</label><br>
      <label for="q5c"><input type="radio" name="q5" id="q5c" value="incorrect">Забороняється використовувати для покупки автомобіля.</label><br>
      <br>
      
      <input type="submit" value="Перевірити відповіді" onclick="submitQuiz()">
    </form>
    <p id="quizResults"></p>
  `;
}

function submitQuiz() {
	event.preventDefault();

	let score = 0;
	const answers = document.getElementById('quizForm');

	if (answers.q1.value === "correct") {
		score++;
	}
	if (answers.q2.value === "correct") {
		score++;
	}
	if (answers.q3.value === "correct") {
		score++;
	}
	if (answers.q4.value === "correct") {
		score++;
	}
	if (answers.q5.value === "correct") {
		score++;
	}

	const quizResults = document.getElementById('quizResults');
	quizResults.innerHTML = `Ваш результат: ${score} правильних відповідей з 5 питань.`;
}


showHomePage();
